Revit 2024 API
DocumentOpenedEventArgs Class
 The event arguments used by the DocumentOpened event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public class DocumentOpenedEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class DocumentOpenedEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class DocumentOpenedEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.DocumentOpenedEventArgs
See Also
DocumentOpenedEventArgs Members
Autodesk.Revit.DB.Events Namespace